
/**************************** (C) COPYRIGHT 2020 ****************************
* 设计师:   Tigerots
* 创建时间: 2020.02
* 功能描述: 
*       
*****************************************************************************
* ********************************修改历史记录********************************
* 修改时间: 
* 版本号:
* 修改内容:
*****************************************************************************/

#include <Arduino.h>
#include <ArduinoJson.h>

#include <my_led.h>
#include <my_serial.h>
#include <my_wifi.h>
#include <my_spiffs.h>


/****************************************************************************
* 编写作者: Tigerots
* 创建时间: 2020.02
* 功能描述: 
			1. 初始化串口（用于打印输出）
			2. 系统运行状态指示（定时器）
			3. WiFi初始化
* 入口参数:
* 出口参数:
* 修改记录:
*****************************************************************************/
void setup()
{
	my_led_init();//LED 指示灯初始化
	my_seial_init(115200);//串口初始化
	my_smartconfig();//自动配网,可以使用安信可微信公众号
	my_wifi_init();//连接到wifi
	my_spiffs_init();//spifs初始化,第一次使用会格式化
	my_spiffs_sample();//SPIFS测试
}

/* ======================================================================
* 编写作者: Tigerots
* 创建时间: 2020.02
* 函数描述: 用户应用程序入口
* 函数功能: 循环运行主函数
=========================================================================*/
void loop(void)
{
	my_web_sever_loop();
	delay(10);
}
